<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 应用设置
// +----------------------------------------------------------------------

use think\facade\Env;

return [
	
	// 权限控制配置
	'auth' => [
		// 权限管理开关
		'on' => true,
		// 权限管理控制类型 1：即时控制 2：登录控制
		'type' => 1,
		// 数据表名称
		'table' => [
			'admin' => 'admin',
			'admin_role' => 'admin_role',
			'role' => 'role',
			'role_node' => 'role_node',
			'node' => 'node',
		],
		// 例外 不需要权限
		'exception' => [
			'home' => 'all',
			'admin' => ['admin/index', 'admin/role'],
			'article' => ['article/index', 'article/add'],
		],
		// 超级管理员
		'super' => ['神织知更'],
		// 是否只显示有权限的导航栏
		'show' => true,
	],
	
];
